---
kind: type
id: T:Autodesk.Revit.DB.NurbsSurfaceData
source: html/7d65dbde-8aac-7d7d-e811-a6c91a541de4.htm
---
# Autodesk.Revit.DB.NurbsSurfaceData

A class used to represent the definition of a NURBS surface.

## Syntax (C#)
```csharp
public class NurbsSurfaceData : IDisposable
```